---
kind: property
id: P:Autodesk.Revit.DB.Dimension.NumberOfSegments
zh: 尺寸标注、标注
source: html/3e01937d-a001-8fd4-9cc8-270ad4b4ba10.htm
---
# Autodesk.Revit.DB.Dimension.NumberOfSegments Property

**中文**: 尺寸标注、标注

The number of segments for the dimension.

## Syntax (C#)
```csharp
public int NumberOfSegments { get; }
```